## Plan for log_archive/main
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`


**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
guardduty.tf
```




```terraform
Plan: 16 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_kms_alias.cds_sentinel_guard_duty_key will be created
  + resource "aws_kms_alias" "cds_sentinel_guard_duty_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/guardduty-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.cds_sentinel_guard_duty_key will be created
  + resource "aws_kms_key" "cds_sentinel_guard_duty_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "CDS Sentinel GuardDuty KMS"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:GenerateDataKey"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "guardduty.amazonaws.com"
                        }
                      + Resource  = "arn:aws:kms:ca-central-1:274536870005:key/*"
                      + Sid       = "1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # module.guardduty_ca_central_1.aws_guardduty_detector.this will be created
  + resource "aws_guardduty_detector" "this" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = "FIFTEEN_MINUTES"
      + id                           = (known after apply)
      + tags                         = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all                     = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }

      + datasources {
          + s3_logs {
              + enable = true
            }
        }
    }

  # module.guardduty_ca_central_1.aws_guardduty_organization_configuration.this will be created
  + resource "aws_guardduty_organization_configuration" "this" {
      + auto_enable = true
      + detector_id = (known after apply)
      + id          = (known after apply)

      + datasources {
          + s3_logs {
              + auto_enable = true
            }
        }
    }

  # module.guardduty_ca_central_1.aws_guardduty_publishing_destination.pub_dest will be created
  + resource "aws_guardduty_publishing_destination" "pub_dest" {
      + destination_arn  = (known after apply)
      + destination_type = "S3"
      + detector_id      = (known after apply)
      + id               = (known after apply)
      + kms_key_arn      = (known after apply)
    }

  # module.guardduty_us_east_1.aws_guardduty_detector.this will be created
  + resource "aws_guardduty_detector" "this" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = "FIFTEEN_MINUTES"
      + id                           = (known after apply)
      + tags                         = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all                     = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }

      + datasources {
          + s3_logs {
              + enable = true
            }
        }
    }

  # module.guardduty_us_east_1.aws_guardduty_organization_configuration.this will be created
  + resource "aws_guardduty_organization_configuration" "this" {
      + auto_enable = true
      + detector_id = (known after apply)
      + id          = (known after apply)

      + datasources {
          + s3_logs {
              + auto_enable = true
            }
        }
    }

  # module.guardduty_us_east_1.aws_guardduty_publishing_destination.pub_dest will be created
  + resource "aws_guardduty_publishing_destination" "pub_dest" {
      + destination_arn  = (known after apply)
      + destination_type = "S3"
      + detector_id      = (known after apply)
      + id               = (known after apply)
      + kms_key_arn      = (known after apply)
    }

  # module.guardduty_us_west_2.aws_guardduty_detector.this will be created
  + resource "aws_guardduty_detector" "this" {
      + account_id                   = (known after apply)
      + arn                          = (known after apply)
      + enable                       = true
      + finding_publishing_frequency = "FIFTEEN_MINUTES"
      + id                           = (known after apply)
      + tags                         = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all                     = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }

      + datasources {
          + s3_logs {
              + enable = true
            }
        }
    }

  # module.guardduty_us_west_2.aws_guardduty_organization_configuration.this will be created
  + resource "aws_guardduty_organization_configuration" "this" {
      + auto_enable = true
      + detector_id = (known after apply)
      + id          = (known after apply)

      + datasources {
          + s3_logs {
              + auto_enable = true
            }
        }
    }

  # module.guardduty_us_west_2.aws_guardduty_publishing_destination.pub_dest will be created
  + resource "aws_guardduty_publishing_destination" "pub_dest" {
      + destination_arn  = (known after apply)
      + destination_type = "S3"
      + detector_id      = (known after apply)
      + id               = (known after apply)
      + kms_key_arn      = (known after apply)
    }

  # module.publishing_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + logging {
          + target_bucket = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.publishing_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.publishing_log_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined"  {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.publishing_log_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.publishing_log_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "cds-aft-log-archive-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.publishing_log_bucket.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.publishing_log_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Warning: Provider aws is undefined

  on guardduty.tf line 13, in module "guardduty_us_east_1":
  13:     aws = aws.us-east-1

Module module.guardduty_us_east_1 does not declare a provider named aws.
If you wish to specify a provider configuration for the module, add an entry
for aws in the required_providers block within the module.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.publishing_bucket.aws_s3_bucket.this,
  on .terraform/modules/publishing_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_logging resource instead

(and 13 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cds_sentinel_guard_duty_key"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy_sc.aws_iam_policy.this"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
